#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.backend.azurerm_resource_group.backend_rg: Refreshing state... [id=/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-backend-lza-prod-eastus-001]
module.shared.data.azurerm_client_config.current: Reading...
module.shared.azurerm_resource_group.shared_rg: Refreshing state... [id=/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-shared-lza-prod-eastus-001]
module.apim.azurerm_resource_group.apim_internal_rg: Refreshing state... [id=/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-apim-lza-prod-eastus-001]
module.networking.azurerm_resource_group.networking_resourece_group: Refreshing state... [id=/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-networking-lza-prod-eastus]
module.shared.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lYWI4ODQ2ZS1lNTE1LTRhMWYtODdmZi1kM2U3YzgxYTg4ZTk7b2JqZWN0SWQ9NmYxYjYwY2EtNTM2Mi00ZjA2LWJjOTAtMGFiNGJiMTc4ZjhhO3N1YnNjcmlwdGlvbklkPTg2NGViOWQwLWU5YzQtNGQ2Yi1iZjExLWJkNGNmZGUwNWU4MTt0ZW5hbnRJZD00NDlmYmUxZC05Yzk5LTQ1MDktOTAxNC00ZmQ1Y2YyNWIwMTQ=]
module.shared.azurerm_private_dns_zone.new_dev_portal: Refreshing state... [id=/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-shared-lza-prod-eastus-001/providers/Microsoft.Network/privateDnsZones/developer.azure-api.net]
module.shared.azurerm_private_dns_zone.gateway: Refreshing state... [id=/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-shared-lza-prod-eastus-001/providers/Microsoft.Network/privateDnsZones/azure-api.net]
module.shared.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-shared-lza-prod-eastus-001/providers/Microsoft.KeyVault/vaults/kv-lza-prod-eastus-001]
module.shared.azurerm_private_dns_zone.scm: Refreshing state... [id=/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-shared-lza-prod-eastus-001/providers/Microsoft.Network/privateDnsZones/scm.azure-api.net]
module.shared.azurerm_log_analytics_workspace.log_analytics_workspace: Refreshing state... [id=/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-shared-lza-prod-eastus-001/providers/Microsoft.OperationalInsights/workspaces/log-lza-prod-eastus-001]
module.shared.azurerm_private_dns_zone.mgmt_portal: Refreshing state... [id=/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-shared-lza-prod-eastus-001/providers/Microsoft.Network/privateDnsZones/management.azure-api.net]
module.shared.azurerm_private_dns_zone.dev_portal: Refreshing state... [id=/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-shared-lza-prod-eastus-001/providers/Microsoft.Network/privateDnsZones/portal.azure-api.net]
module.networking.azurerm_public_ip.public_ip: Refreshing state... [id=/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-networking-lza-prod-eastus/providers/Microsoft.Network/publicIPAddresses/pip-apimcs-lza-prod-eastus]
module.networking.azurerm_network_security_group.devops_nsg: Refreshing state... [id=/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-networking-lza-prod-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-devops-lza-prod-eastus]
module.networking.azurerm_network_security_group.private_endpoint_snnsg_nsg: Refreshing state... [id=/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-networking-lza-prod-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-prep-lza-prod-eastus]
module.networking.azurerm_public_ip.bastion_public_ip: Refreshing state... [id=/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-networking-lza-prod-eastus/providers/Microsoft.Network/publicIPAddresses/pip-bastion-lza-prod-eastus]
module.networking.azurerm_network_security_group.backend_snnsg_nsg: Refreshing state... [id=/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-networking-lza-prod-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-bcke-lza-prod-eastus]
module.networking.azurerm_network_security_group.appgateway_nsg: Refreshing state... [id=/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-networking-lza-prod-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-apgw-lza-prod-eastus]
module.networking.azurerm_network_security_group.jumpbox_nsg: Refreshing state... [id=/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-networking-lza-prod-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-jbox-lza-prod-eastus]
module.networking.azurerm_network_security_group.apim_snnsg_nsg: Refreshing state... [id=/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-networking-lza-prod-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-apim-lza-prod-eastus]
module.networking.azurerm_network_security_group.bastion_nsg: Refreshing state... [id=/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-networking-lza-prod-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-bast-lza-prod-eastus]
module.backend.azurerm_service_plan.function_app_service_plan: Refreshing state... [id=/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-backend-lza-prod-eastus-001/providers/Microsoft.Web/serverfarms/asp-lza-prod-eastus-001]
module.backend.azurerm_storage_account.backend_storage_account: Refreshing state... [id=/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-backend-lza-prod-eastus-001/providers/Microsoft.Storage/storageAccounts/stbackendlzaeastus]
module.shared.azurerm_key_vault_access_policy.deployment_spn_access_policy: Refreshing state... [id=/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-shared-lza-prod-eastus-001/providers/Microsoft.KeyVault/vaults/kv-lza-prod-eastus-001/objectId/6f1b60ca-5362-4f06-bc90-0ab4bb178f8a]
module.application_gateway.azurerm_user_assigned_identity.user_assigned_identity: Refreshing state... [id=/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-apim-lza-prod-eastus-001/providers/Microsoft.ManagedIdentity/userAssignedIdentities/identity-appgw-001]
module.application_gateway.azurerm_public_ip.public_ip: Refreshing state... [id=/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-apim-lza-prod-eastus-001/providers/Microsoft.Network/publicIPAddresses/pip-appgw-001]
module.shared.azurerm_application_insights.shared_apim_insight: Refreshing state... [id=/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-shared-lza-prod-eastus-001/providers/Microsoft.Insights/components/appi-lza-prod-eastus-001]
module.networking.azurerm_virtual_network.apim_cs_vnet: Refreshing state... [id=/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-networking-lza-prod-eastus/providers/Microsoft.Network/virtualNetworks/vnet-apim-cs-lza-prod-eastus]
module.application_gateway.azurerm_key_vault_access_policy.user_assigned_identity_keyvault_permissions: Refreshing state... [id=/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-shared-lza-prod-eastus-001/providers/Microsoft.KeyVault/vaults/kv-lza-prod-eastus-001/objectId/fc145a3c-c222-49df-80b1-1488ba5cc8c6]
module.shared.azurerm_private_dns_zone_virtual_network_link.mgmt_vnetlink: Refreshing state... [id=/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-shared-lza-prod-eastus-001/providers/Microsoft.Network/privateDnsZones/management.azure-api.net/virtualNetworkLinks/mgmt-vnet-link]
module.networking.azurerm_bastion_host.bastion_host: Refreshing state... [id=/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-networking-lza-prod-eastus/providers/Microsoft.Network/bastionHosts/bastion-lza-prod-eastus]
module.shared.azurerm_private_dns_zone_virtual_network_link.dev_portal_vnetlink: Refreshing state... [id=/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-shared-lza-prod-eastus-001/providers/Microsoft.Network/privateDnsZones/portal.azure-api.net/virtualNetworkLinks/portal-vnet-link]
module.shared.azurerm_private_dns_zone_virtual_network_link.scm_vnetlink: Refreshing state... [id=/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-shared-lza-prod-eastus-001/providers/Microsoft.Network/privateDnsZones/scm.azure-api.net/virtualNetworkLinks/scm-vnet-link]
module.shared.azurerm_private_dns_zone_virtual_network_link.new_dev_portal_vnetlink: Refreshing state... [id=/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-shared-lza-prod-eastus-001/providers/Microsoft.Network/privateDnsZones/developer.azure-api.net/virtualNetworkLinks/dev-portal-vnet-link]
module.shared.azurerm_private_dns_zone_virtual_network_link.gateway_vnetlink: Refreshing state... [id=/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-shared-lza-prod-eastus-001/providers/Microsoft.Network/privateDnsZones/azure-api.net/virtualNetworkLinks/gateway-vnet-link]
module.apim.azurerm_api_management.apim_internal: Refreshing state... [id=/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-apim-lza-prod-eastus-001/providers/Microsoft.ApiManagement/service/apim-lza-prod-eastus-001]
module.shared.azurerm_network_interface.vm_nic: Refreshing state... [id=/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-shared-lza-prod-eastus-001/providers/Microsoft.Network/networkInterfaces/jumpbox-prod-nic]
module.shared.azurerm_windows_virtual_machine.agent_vm: Refreshing state... [id=/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-shared-lza-prod-eastus-001/providers/Microsoft.Compute/virtualMachines/jumpbox-prod]
module.shared.azurerm_virtual_machine_extension.deploy_agent[0]: Refreshing state... [id=/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-shared-lza-prod-eastus-001/providers/Microsoft.Compute/virtualMachines/jumpbox-prod/extensions/devops_agent]
module.backend.azurerm_linux_function_app.function_app_container: Refreshing state... [id=/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-backend-lza-prod-eastus-001/providers/Microsoft.Web/sites/func-cont-lza-prod-eastus-001]
module.backend.azurerm_linux_function_app.function_app: Refreshing state... [id=/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-backend-lza-prod-eastus-001/providers/Microsoft.Web/sites/func-code-lza-prod-eastus-001]
module.apim.azurerm_api_management_logger.apim_logger: Refreshing state... [id=/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-apim-lza-prod-eastus-001/providers/Microsoft.ApiManagement/service/apim-lza-prod-eastus-001/loggers/apim-logger]
module.shared.azurerm_private_dns_a_record.dev_portal_record: Refreshing state... [id=/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-shared-lza-prod-eastus-001/providers/Microsoft.Network/privateDnsZones/portal.azure-api.net/A/portal]
module.shared.azurerm_private_dns_a_record.scm_record: Refreshing state... [id=/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-shared-lza-prod-eastus-001/providers/Microsoft.Network/privateDnsZones/scm.azure-api.net/A/scm]
module.shared.azurerm_private_dns_a_record.new_dev_portal_record: Refreshing state... [id=/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-shared-lza-prod-eastus-001/providers/Microsoft.Network/privateDnsZones/developer.azure-api.net/A/developer]
module.shared.azurerm_private_dns_a_record.mgmt_portal_record: Refreshing state... [id=/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-shared-lza-prod-eastus-001/providers/Microsoft.Network/privateDnsZones/management.azure-api.net/A/management]
module.shared.azurerm_private_dns_a_record.gateway_record: Refreshing state... [id=/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-shared-lza-prod-eastus-001/providers/Microsoft.Network/privateDnsZones/azure-api.net/A/apim-lza-prod-eastus-001]
module.apim.azurerm_api_management_diagnostic.apim_diagnostic: Refreshing state... [id=/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-apim-lza-prod-eastus-001/providers/Microsoft.ApiManagement/service/apim-lza-prod-eastus-001/diagnostics/applicationinsights]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.application_gateway.azurerm_application_gateway.network will be created
  + resource "azurerm_application_gateway" "network" {
      + enable_http2                = true
      + id                          = (known after apply)
      + location                    = "eastus"
      + name                        = "appgw-001"
      + private_endpoint_connection = (known after apply)
      + resource_group_name         = "rg-apim-lza-prod-eastus-001"

      + autoscale_configuration {
          + max_capacity = 3
          + min_capacity = 2
        }

      + backend_address_pool {
          + fqdns        = [
              + "apim-lza-prod-eastus-001.azure-api.net",
            ]
          + id           = (known after apply)
          + ip_addresses = []
          + name         = "apim"
        }

      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + host_name                           = "apim-lza-prod-eastus-001.azure-api.net"
          + id                                  = (known after apply)
          + name                                = "https"
          + pick_host_name_from_backend_address = false
          + port                                = 443
          + probe_id                            = (known after apply)
          + probe_name                          = "APIM"
          + protocol                            = "Https"
          + request_timeout                     = 20
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + affinity_cookie_name                = "ApplicationGatewayAffinity"
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "default"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + protocol                            = "Http"
          + request_timeout                     = 20
          + trusted_root_certificate_names      = []
        }

      + frontend_ip_configuration {
          + id                            = (known after apply)
          + name                          = "appGwPublicFrontendIp"
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = "Dynamic"
          + private_link_configuration_id = (known after apply)
          + public_ip_address_id          = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-apim-lza-prod-eastus-001/providers/Microsoft.Network/publicIPAddresses/pip-appgw-001"
        }

      + frontend_port {
          + id   = (known after apply)
          + name = "port_443"
          + port = 443
        }
      + frontend_port {
          + id   = (known after apply)
          + name = "port_80"
          + port = 80
        }

      + gateway_ip_configuration {
          + id        = (known after apply)
          + name      = "appGatewayIpConfig"
          + subnet_id = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-networking-lza-prod-eastus/providers/Microsoft.Network/virtualNetworks/vnet-apim-cs-lza-prod-eastus/subnets/snet-apgw-lza-prod-eastus-001"
        }

      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPublicFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "port_443"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "https"
          + protocol                       = "Https"
          + require_sni                    = false
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "api.contoso.com"
          + ssl_profile_id                 = (known after apply)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPublicFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "port_80"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "default"
          + protocol                       = "Http"
          + require_sni                    = false
          + ssl_certificate_id             = (known after apply)
          + ssl_profile_id                 = (known after apply)
        }

      + identity {
          + identity_ids = [
              + "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-apim-lza-prod-eastus-001/providers/Microsoft.ManagedIdentity/userAssignedIdentities/identity-appgw-001",
            ]
          + type         = "UserAssigned"
        }

      + probe {
          + host                                      = "apim-lza-prod-eastus-001.azure-api.net"
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "APIM"
          + path                                      = "/status-0123456789abcdef"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Https"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3

          + match {
              + status_code = [
                  + "200-399",
                ]
            }
        }

      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "apim"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "https"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "https"
          + id                         = (known after apply)
          + name                       = "apim"
          + priority                   = 100
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

      + sku {
          + name = "WAF_v2"
          + tier = "WAF_v2"
        }

      + ssl_certificate {
          + id                  = (known after apply)
          + key_vault_secret_id = (known after apply)
          + name                = "api.contoso.com"
          + public_cert_data    = (known after apply)
        }

      + ssl_policy {
          + cipher_suites        = (known after apply)
          + disabled_protocols   = (known after apply)
          + min_protocol_version = (known after apply)
          + policy_name          = (known after apply)
          + policy_type          = (known after apply)
        }

      + waf_configuration {
          + enabled                  = true
          + file_upload_limit_mb     = 100
          + firewall_mode            = "Detection"
          + max_request_body_size_kb = 128
          + request_body_check       = true
          + rule_set_type            = "OWASP"
          + rule_set_version         = "3.0"
        }
    }

  # module.application_gateway.azurerm_key_vault_certificate.local_domain_certs[0] will be created
  + resource "azurerm_key_vault_certificate" "local_domain_certs" {
      + certificate_attribute   = (known after apply)
      + certificate_data        = (known after apply)
      + certificate_data_base64 = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-shared-lza-prod-eastus-001/providers/Microsoft.KeyVault/vaults/kv-lza-prod-eastus-001"
      + name                    = "generated-cert"
      + secret_id               = (known after apply)
      + thumbprint              = (known after apply)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
      + versionless_secret_id   = (known after apply)

      + certificate_policy {
          + issuer_parameters {
              + name = "Self"
            }

          + key_properties {
              + curve      = (known after apply)
              + exportable = true
              + key_size   = 2048
              + key_type   = "RSA"
              + reuse_key  = true
            }

          + lifetime_action {
              + action {
                  + action_type = "AutoRenew"
                }

              + trigger {
                  + days_before_expiry = 30
                }
            }

          + secret_properties {
              + content_type = "application/x-pkcs12"
            }

          + x509_certificate_properties {
              + extended_key_usage = [
                  + "1.3.6.1.5.5.7.3.1",
                ]
              + key_usage          = [
                  + "digitalSignature",
                  + "keyEncipherment",
                ]
              + subject            = "CN=api.contoso.com"
              + validity_in_months = 12

              + subject_alternative_names {
                  + dns_names = (known after apply)
                  + emails    = (known after apply)
                  + upns      = (known after apply)
                }
            }
        }
    }

  # module.shared.azurerm_key_vault_access_policy.deployment_spn_access_policy will be destroyed
  # (because resource uses count or for_each)
  - resource "azurerm_key_vault_access_policy" "deployment_spn_access_policy" {
      - certificate_permissions = [
          - "Import",
          - "Get",
          - "List",
          - "Update",
          - "Create",
        ] -> null
      - id                      = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-shared-lza-prod-eastus-001/providers/Microsoft.KeyVault/vaults/kv-lza-prod-eastus-001/objectId/6f1b60ca-5362-4f06-bc90-0ab4bb178f8a" -> null
      - key_permissions         = [
          - "Get",
        ] -> null
      - key_vault_id            = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-shared-lza-prod-eastus-001/providers/Microsoft.KeyVault/vaults/kv-lza-prod-eastus-001" -> null
      - object_id               = "6f1b60ca-5362-4f06-bc90-0ab4bb178f8a" -> null
      - secret_permissions      = [
          - "Get",
        ] -> null
      - storage_permissions     = [
          - "Get",
        ] -> null
      - tenant_id               = "449fbe1d-9c99-4509-9014-4fd5cf25b014" -> null
    }

  # module.shared.azurerm_key_vault_access_policy.deployment_spn_access_policy["6f1b60ca-5362-4f06-bc90-0ab4bb178f8a"] will be created
  + resource "azurerm_key_vault_access_policy" "deployment_spn_access_policy" {
      + certificate_permissions = [
          + "Import",
          + "Get",
          + "List",
          + "Update",
          + "Create",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
        ]
      + key_vault_id            = "/subscriptions/864eb9d0-e9c4-4d6b-bf11-bd4cfde05e81/resourceGroups/rg-shared-lza-prod-eastus-001/providers/Microsoft.KeyVault/vaults/kv-lza-prod-eastus-001"
      + object_id               = "6f1b60ca-5362-4f06-bc90-0ab4bb178f8a"
      + secret_permissions      = [
          + "Get",
        ]
      + storage_permissions     = [
          + "Get",
        ]
      + tenant_id               = "449fbe1d-9c99-4509-9014-4fd5cf25b014"
    }

Plan: 3 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: //home/runner/work/_temp/appgw-iapim-func.53.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "//home/runner/work/_temp/appgw-iapim-func.53.tfplan"

```

</details>

*Pusher: @JinLee794, Action: `pull_request`, Working Directory: `reference-implementations/AppGW-IAPIM-Func/terraform`, Workflow: `Terraform ES-APIM Deploy`*